aureoleday/grating/bsp/stm32/acc_tx/usr/drv/drv_can.c
    return RT_EOK;
}

static int drv_sendmsg(struct rt_can_device *can, const void *buf, rt_uint32_t boxno)
{
    CAN_HandleTypeDef *hcan = RT_NULL;
    CAN_TxHeaderTypeDef *pTxMsg = RT_NULL;
    hcan = &((struct stm32_drv_can *) can->parent.user_data)->CanHandle;
    pTxMsg = &((struct stm32_drv_can *) can->parent.user_data)->TxMessage;
    struct rt_can_msg *pmsg = (struct rt_can_msg *) buf;

    /*check Select mailbox  is empty */
    switch (boxno)
    {
    case 0:
        if (HAL_IS_BIT_SET(hcan->Instance->TSR, CAN_TSR_TME0) != SET)
        {
            /* Change CAN state */
            hcan->State = HAL_CAN_STATE_ERROR;
            /* Return function status */
            return -RT_ERROR;
        }
        break;
    case 1:
        if (HAL_IS_BIT_SET(hcan->Instance->TSR, CAN_TSR_TME1) != SET)
        {
            /* Change CAN state */
            hcan->State = HAL_CAN_STATE_ERROR;
            /* Return function status */
            return -RT_ERROR;
        }
        break;
    case 2:
        if (HAL_IS_BIT_SET(hcan->Instance->TSR, CAN_TSR_TME2) != SET)
        {
            /* Change CAN state */
            hcan->State = HAL_CAN_STATE_ERROR;
            /* Return function status */
            return -RT_ERROR;
        }
        break;
    default:
        RT_ASSERT(0);
        break;
    }

    /* check id type */
    if (RT_CAN_STDID == pmsg->ide)
    {
        pTxMsg->IDE = CAN_ID_STD;
        pTxMsg->StdId = pmsg->id;
        pTxMsg->ExtId = 0xFFFFFFFFU;
    }
    else if (RT_CAN_EXTID == pmsg->ide)
    {
        pTxMsg->IDE = CAN_ID_EXT;
        pTxMsg->StdId = 0xFFFFFFFFU;
        pTxMsg->ExtId = pmsg->id;
    }

    /* check frame type */
    if (RT_CAN_DTR == pmsg->rtr)
    {
        pTxMsg->RTR = CAN_RTR_DATA;
    }
    else if (RT_CAN_RTR == pmsg->rtr)
    {
        pTxMsg->RTR = CAN_RTR_REMOTE;
    }

    pTxMsg->DLC = pmsg->len;

    /* clear TIR */
    hcan->Instance->sTxMailBox[boxno].TIR &= CAN_TI0R_TXRQ;
    /* Set up the Id */
    if (pTxMsg->IDE == CAN_ID_STD)
    {
        assert_param(IS_CAN_STDID(hcan->pTxMsg->StdId));
        hcan->Instance->sTxMailBox[boxno].TIR |= ((pTxMsg->StdId << CAN_TI0R_STID_Pos) | \
                pTxMsg->RTR);
    }
    else
    {
        assert_param(IS_CAN_EXTID(hcan->pTxMsg->ExtId));
        hcan->Instance->sTxMailBox[boxno].TIR |= (pTxMsg->ExtId << CAN_TI0R_EXID_Pos) | \
                pTxMsg->IDE |
                pTxMsg->RTR;
    }
    /* Set up the DLC */
    pTxMsg->DLC &= (uint8_t)0x0000000FU;
    hcan->Instance->sTxMailBox[boxno].TDTR &= 0xFFFFFFF0U;
    hcan->Instance->sTxMailBox[boxno].TDTR |= pTxMsg->DLC;

    /* Set up the data field */
    WRITE_REG(hcan->Instance->sTxMailBox[boxno].TDLR, ((uint32_t)pmsg->data[3U] << CAN_TDL0R_DATA3_Pos) |
              ((uint32_t)pmsg->data[2U] << CAN_TDL0R_DATA2_Pos) |
              ((uint32_t)pmsg->data[1U] << CAN_TDL0R_DATA1_Pos) |
              ((uint32_t)pmsg->data[0U] << CAN_TDL0R_DATA0_Pos));
    WRITE_REG(hcan->Instance->sTxMailBox[boxno].TDHR, ((uint32_t)pmsg->data[7U] << CAN_TDL0R_DATA3_Pos) |
              ((uint32_t)pmsg->data[6U] << CAN_TDL0R_DATA2_Pos) |
              ((uint32_t)pmsg->data[5U] << CAN_TDL0R_DATA1_Pos) |
              ((uint32_t)pmsg->data[4U] << CAN_TDL0R_DATA0_Pos));

    /* Request transmission */
    hcan->Instance->sTxMailBox[boxno].TIR |= CAN_TI0R_TXRQ;

    return RT_EOK;
}

static int drv_recvmsg(struct rt_can_device *can, void *buf, rt_uint32_t boxno)
{
    CAN_RxHeaderTypeDef *pRxMsg = RT_NULL;
    uint8_t *data = RT_NULL;
    struct rt_can_msg *pmsg = (struct rt_can_msg *) buf;

    /* get FIFO */
    switch (boxno)
    {
    case CAN_RX_FIFO0:
        pRxMsg = &((struct stm32_drv_can *) can->parent.user_data)->RxMessage;
        data = ((struct stm32_drv_can *) can->parent.user_data)->RxMessage_Data;
        break;
    case CAN_RX_FIFO1:
        pRxMsg = &((struct stm32_drv_can *) can->parent.user_data)->Rx1Message;
        data = ((struct stm32_drv_can *) can->parent.user_data)->Rx1Message_Data;
        break;
    default:
        RT_ASSERT(0);
        break;
    }

    /* copy data */
    /* get id */
    if (CAN_ID_STD == pRxMsg->IDE)
    {
        pmsg->ide = RT_CAN_STDID;
        pmsg->id = pRxMsg->StdId;
    } 
    else if (CAN_ID_EXT == pRxMsg->IDE)
    {
        pmsg->ide = RT_CAN_EXTID;
        pmsg->id = pRxMsg->ExtId;
    }
    /* get type */
    if (CAN_RTR_DATA == pRxMsg->RTR)
    {
        pmsg->rtr = RT_CAN_DTR;
    }
    else if (CAN_RTR_REMOTE == pRxMsg->RTR)
    {
        pmsg->rtr = RT_CAN_RTR;
    }
    /* get len */
    pmsg->len = pRxMsg->DLC;
    /* get hdr */
    pmsg->hdr = pRxMsg->FilterMatchIndex;
    /* get data */
    pmsg->data[0] = data[0];
    pmsg->data[1] = data[1];
    pmsg->data[2] = data[2];
    pmsg->data[3] = data[3];
    pmsg->data[4] = data[4];
    pmsg->data[5] = data[5];
    pmsg->data[6] = data[6];
    pmsg->data[7] = data[7];
    return RT_EOK;
}

static const struct rt_can_ops drv_can_ops =
{
    drv_configure,
    drv_control,
    drv_sendmsg,
    drv_recvmsg,
};

int rt_hw_can_init(void)
{
    struct stm32_drv_can *drv_can;
    struct can_configure config = CANDEFAULTCONFIG;
    config.baud_rate = CAN500kBaud;
    config.privmode = 0;
    config.ticks = 50;
    config.sndboxnumber = 3;
    config.msgboxsz = 32;
#ifdef RT_CAN_USING_HDR
    config.maxhdr = 14;
#ifdef CAN2
    config.maxhdr = 28;
#endif
#endif

#ifdef BSP_USING_CAN1
    drv_can = &drv_can1;
    drv_can->CanHandle.Instance = CAN1;
    dev_can1.ops    = &drv_can_ops;
    dev_can1.config = config;
    /* register CAN1 device */
    rt_hw_can_register(&dev_can1, "can1",
                       &drv_can_ops,
                       drv_can);
#endif /* BSP_USING_CAN1 */

#ifdef BSP_USING_CAN2
    drv_can = &drv_can2;
    drv_can->CanHandle.Instance = CAN2;
    dev_can2.ops    = &drv_can_ops;
    dev_can2.config = config;
    /* register CAN2 device */
    rt_hw_can_register(&dev_can2, "can2",
                       &drv_can_ops,
                       drv_can);
#endif /* BSP_USING_CAN2 */

    return 0;
}

INIT_BOARD_EXPORT(rt_hw_can_init);

#endif /* RT_USING_CAN */
